{
    "_note": "x.y = major.minor version. z versions are bugfixes and may not be listed here.",
    "version": {
        "0.2": [
            {
                "title": {
                    "de": "Neues Dashboard",
                    "en": "New Dashboard"
                },
                "description": {
                    "de": "Hinzugefügt: Anpassbares Dashboard. Gehe zur Einstellungsseite, um es anzupassen.",
                    "en": "Added a customizable dashboard. Go to the settings page to customize it."
                },
                "icon": {
                    "ios": "rectangle.3.group",
                    "android": "dashboard-customize"
                }
            },
            {
                "title": {
                    "de": "Akzentfarben",
                    "en": "Accent Colors"
                },
                "description": {
                    "de": "Wähle aus 9 verschiedenen Akzentfarben, um deine Erfahrung zu personalisieren.",
                    "en": "Choose from 9 different accent colors to personalize your experience."
                },
                "icon": {
                    "ios": "paintpalette",
                    "android": "palette"
                }
            },
            {
                "title": {
                    "de": "Onboarding & Changelog",
                    "en": "Onboarding & Changelog"
                },
                "description": {
                    "de": "Diese neue Übersicht zeigt die wichtigsten Änderungen nach einem Update. Neue Nutzern wird außerdem ein Onboarding angezeigt.",
                    "en": "This new overview shows the most important changes after an update. New users also see an onboarding."
                },
                "icon": {
                    "ios": "newspaper",
                    "android": "newspaper"
                }
            }
        ],
        "0.3": [
            {
                "title": {
                    "de": "Lokalisierung (DE / EN)",
                    "en": "Localization (DE / EN)"
                },
                "description": {
                    "de": "Die App ist nun in zwei Sprachen verfügbar. Die Sprache kann in den Einstellungen geändert werden.",
                    "en": "The app is now available in two languages. The language can be changed in the settings."
                },
                "icon": {
                    "ios": "globe",
                    "android": "language"
                }
            },
            {
                "title": {
                    "de": "Essens Variationen",
                    "en": "Food Variations"
                },
                "description": {
                    "de": "Verfügbare Variationen werden nun in den Detaisl angezeigt. Außerdem kann nach dauerhaft verfügbaren Gerichten gefiltert werden.",
                    "en": "Available variations are now displayed in the details. In addition, you can filter by permanently available dishes."
                },
                "icon": {
                    "ios": "carrot",
                    "android": "restaurant"
                }
            }
        ],
        "0.4": [
            {
                "title": {
                    "de": "Studenplan",
                    "en": "Timetable"
                },
                "description": {
                    "de": "Der Studenplan wurde von Grund auf überarbeitet. Du siehst nun alle nötigen Informationen auf einen Blick und kannst bei Bedarf mehr Details anzeigen lassen.",
                    "en": "The study plan has been completely revised. You can now see all the necessary information at a glance and can display more details if needed."
                },
                "icon": {
                    "ios": "calendar",
                    "android": "calendar"
                }
            },
            {
                "title": {
                    "de": "Notenübersicht",
                    "en": "Grades overview"
                },
                "description": {
                    "de": "Nun kannst du deine Notenübersicht einsehen. Diese findest du in deinem Profil.",
                    "en": "You can now view your grades overview. These can be found in your profile."
                },
                "icon": {
                    "ios": "book",
                    "android": "book"
                }
            }
        ],
        "0.5": [
            {
                "title": {
                    "de": "Bibliothek",
                    "en": "Library"
                },
                "description": {
                    "de": "Reserviere Plätze in der Bibliothek und nutze die digitale Bibliothekskarte, um Medien auszuleihen.",
                    "en": "Reserve seats in the library and use the digital library card to borrow media."
                },
                "icon": {
                    "ios": "books.vertical",
                    "android": "book"
                }
            },
            {
                "title": {
                    "de": "THI-News",
                    "en": "THI-News"
                },
                "description": {
                    "de": "Rufe die neusten Pressemitteilungen der THI direkt in der App ab.",
                    "en": "Get the latest press releases from THI directly in the app."
                },
                "icon": {
                    "ios": "newspaper",
                    "android": "newspaper"
                }
            },
            {
                "title": {
                    "de": "Neue Icons und Farben",
                    "en": "New Icons and Colors"
                },
                "description": {
                    "de": "Die App verwendet nun native Icons. Außerdem wurden die Akzentfarben komplett überarbeitet.",
                    "en": "The app uses native icons now. In addition, the accent colors have been revised completely."
                },
                "icon": {
                    "ios": "paintpalette",
                    "android": "palette"
                }
            }
        ],
        "0.6": [
            {
                "title": {
                    "de": "Kalender Listenansicht",
                    "en": "Calendar Agenda View"
                },
                "description": {
                    "de": "Wechsle zwischen der normalen Kalenderansicht und einer Listenansicht, um alle Termine auf einen Blick zu sehen.",
                    "en": "Switch between the normal calendar view and an agenda view to see all appointments at a glance."
                },
                "icon": {
                    "ios": "calendar",
                    "android": "calendar"
                }
            },
            {
                "title": {
                    "de": "Analytik",
                    "en": "Analytics"
                },
                "description": {
                    "de": "Die App sammelt nun anonyme und nicht personenbezogene Daten, um die App zu verbessern. Deine Privatsphäre bleibt dabei geschützt.",
                    "en": "The app now collects anonymous and non-personal data to improve the app. Your privacy is protected at all times."
                },
                "icon": {
                    "ios": "chart.pie",
                    "android": "insert-chart"
                }
            }
        ]
    }
}
