{
    "_note": "x.y = major.minor version. z versions are bugfixes and may not be listed here.",
    "version": {
        "0.2": [
            {
                "title": {
                    "de": "Neues Dashboard",
                    "en": "New Dashboard"
                },
                "description": {
                    "de": "Hinzugefügt: Anpassbares Dashboard. Gehe zur Einstellungsseite, um es anzupassen.",
                    "en": "Added a customizable dashboard. Go to the settings page to customize it."
                },
                "icon": {
                    "ios": "rectangle.3.group",
                    "android": "dashboard_customize"
                }
            },
            {
                "title": {
                    "de": "Akzentfarben",
                    "en": "Accent Colors"
                },
                "description": {
                    "de": "Wähle aus 9 verschiedenen Akzentfarben, um deine Erfahrung zu personalisieren.",
                    "en": "Choose from 9 different accent colors to personalize your experience."
                },
                "icon": {
                    "ios": "paintpalette",
                    "android": "palette"
                }
            },
            {
                "title": {
                    "de": "Onboarding & Changelog",
                    "en": "Onboarding & Changelog"
                },
                "description": {
                    "de": "Diese neue Übersicht zeigt die wichtigsten Änderungen nach einem Update. Neue Nutzern wird außerdem ein Onboarding angezeigt.",
                    "en": "This new overview shows the most important changes after an update. New users also see an onboarding."
                },
                "icon": {
                    "ios": "newspaper",
                    "android": "newspaper"
                }
            }
        ],
        "0.3": [
            {
                "title": {
                    "de": "Lokalisierung (DE / EN)",
                    "en": "Localization (DE / EN)"
                },
                "description": {
                    "de": "Die App ist nun in zwei Sprachen verfügbar. Die Sprache kann in den Einstellungen geändert werden.",
                    "en": "The app is now available in two languages. The language can be changed in the settings."
                },
                "icon": {
                    "ios": "globe",
                    "android": "language"
                }
            },
            {
                "title": {
                    "de": "Essens Variationen",
                    "en": "Food Variations"
                },
                "description": {
                    "de": "Verfügbare Variationen werden nun in den Detaisl angezeigt. Außerdem kann nach dauerhaft verfügbaren Gerichten gefiltert werden.",
                    "en": "Available variants are now displayed in the details. In addition, you can filter by permanently available dishes."
                },
                "icon": {
                    "ios": "carrot",
                    "android": "restaurant"
                }
            }
        ],
        "0.4": [
            {
                "title": {
                    "de": "Studenplan",
                    "en": "Timetable"
                },
                "description": {
                    "de": "Der Studenplan wurde von Grund auf überarbeitet. Du siehst nun alle nötigen Informationen auf einen Blick und kannst bei Bedarf mehr Details anzeigen lassen.",
                    "en": "The study plan has been completely revised. You can now see all the necessary information at a glance and can display more details if needed."
                },
                "icon": {
                    "ios": "calendar",
                    "android": "calendar"
                }
            },
            {
                "title": {
                    "de": "Notenübersicht",
                    "en": "Grades overview"
                },
                "description": {
                    "de": "Nun kannst du deine Notenübersicht einsehen. Diese findest du in deinem Profil.",
                    "en": "You can now view your grades overview. These can be found in your profile."
                },
                "icon": {
                    "ios": "book",
                    "android": "book"
                }
            }
        ],
        "0.5": [
            {
                "title": {
                    "de": "Bibliothek",
                    "en": "Library"
                },
                "description": {
                    "de": "Reserviere Plätze in der Bibliothek und nutze die digitale Bibliothekskarte, um Medien auszuleihen.",
                    "en": "Reserve seats in the library and use the digital library card to borrow media."
                },
                "icon": {
                    "ios": "books.vertical",
                    "android": "book"
                }
            },
            {
                "title": {
                    "de": "THI-News",
                    "en": "THI-News"
                },
                "description": {
                    "de": "Rufe die neusten Pressemitteilungen der THI direkt in der App ab.",
                    "en": "Get the latest press releases from THI directly in the app."
                },
                "icon": {
                    "ios": "newspaper",
                    "android": "newspaper"
                }
            },
            {
                "title": {
                    "de": "Neue Icons und Farben",
                    "en": "New Icons and Colors"
                },
                "description": {
                    "de": "Die App verwendet nun native Icons. Außerdem wurden die Akzentfarben komplett überarbeitet.",
                    "en": "The app uses native icons now. In addition, the accent colors have been revised completely."
                },
                "icon": {
                    "ios": "paintpalette",
                    "android": "palette"
                }
            }
        ],
        "0.6": [
            {
                "title": {
                    "de": "Kalender Neugestaltung",
                    "en": "Calendar Redesign"
                },
                "description": {
                    "de": "Der Kalender verfügt nun über eine neue Agenda und Tagesansicht. Außerdem können nun Benachrichtigungen für Vorlesungen aktiviert werden.",
                    "en": "The calendar now has a new agenda and day view. In addition, notifications for lectures can now be activated."
                },
                "icon": {
                    "ios": "calendar",
                    "android": "calendar"
                }
            },
            {
                "title": {
                    "de": "Mensa Verbesserungen",
                    "en": "Food Improvements"
                },
                "description": {
                    "de": "Swipen, Varianten, bessere Allergenanzeige und mehr. Der Essen Tab wurde komplett überarbeitet.",
                    "en": "Swiping, variants, better allergen display and more. The food tab has been completely revised."
                },
                "icon": {
                    "ios": "fork.knife",
                    "android": "restaurant"
                }
            },
            {
                "title": {
                    "de": "Anonyme Statistiken",
                    "en": "Anonymous Analytics"
                },
                "description": {
                    "de": "Die App sammelt nun anonyme Nutzungsdaten, um die App zu verbessern. Deine Privatsphäre bleibt dabei zu jeder Zeit geschützt.",
                    "en": "The app now collects anonymous usage data to improve the app. Your privacy is protected at all times."
                },
                "icon": {
                    "ios": "lock.shield",
                    "android": "chart_pie"
                }
            }
        ],
        "0.7": [
            {
                "title": {
                    "de": "Karten Redesign",
                    "en": "Map Redesign"
                },
                "description": {
                    "de": "Die Karte wurde komplett überarbeitet und bietet bessere Bedienbarkeit, mehr Informationen und neues Design.",
                    "en": "The map has been completely redesigned and offers better usability, more information and a new design."
                },
                "icon": {
                    "ios": "map",
                    "android": "map"
                }
            },
            {
                "title": {
                    "de": "KI-gestützte Suche",
                    "en": "AI-powered Search"
                },
                "description": {
                    "de": "Finde Räume schneller mit KI-gestützten Vorschlägen in der neuen Karten Suche.",
                    "en": "Discover rooms quicker with AI-powered suggestions in the new map search."
                },
                "icon": {
                    "ios": "sparkle.magnifyingglass",
                    "android": "search"
                }
            },
            {
                "title": {
                    "de": "Fehlerbehebungen & Performance",
                    "en": "Bug Fixes & Performance"
                },
                "description": {
                    "de": "Viele kleine Details wurden optimiert, um die App noch besser und schneller zu machen.",
                    "en": "Many small details have been optimized to make the app even better and faster."
                },
                "icon": {
                    "ios": "hammer",
                    "android": "bug_report"
                }
            }
        ],
        "0.8": [
            {
                "title": {
                    "de": "Karten Darkmode",
                    "en": "Map Darkmode"
                },
                "description": {
                    "de": "Aktiviere den Darkmode, um eine dunkle Kartenansicht zu erhalten. Zudem wurde auch die helle Ansicht komplett erneuert und optimiert.",
                    "en": "Enable dark mode to get a dark map view. In addition, the light view has also been completely renewed and optimized."
                },
                "icon": {
                    "ios": "moon.stars",
                    "android": "dark_mode"
                }
            },
            {
                "title": {
                    "de": "Native Karten",
                    "en": "Native Map"
                },
                "description": {
                    "de": "Die Karte komplett neu geschrieben und verfügt nun über natives Rendering, Gesten und noch mehr Informationen.",
                    "en": "The map has been completely rewritten and now has native rendering, gestures and even more information."
                },
                "icon": {
                    "ios": "map",
                    "android": "map"
                }
            },

            {
                "title": {
                    "de": "Event Details",
                    "en": "Event Details"
                },
                "description": {
                    "de": "Tippe auf ein Event, um mehr Informationen zu erhalten, wie zum Ort oder der Beschreibung.",
                    "en": "Tap on an event to get more information, such as the location or description."
                },
                "icon": {
                    "ios": "party.popper",
                    "android": "event"
                }
            }
        ]
    }
}
