{
    "_note": "x.y = major.minor version. z versions are bugfixes and may not be listed here.",
    "version": {
        "0.2": [
            {
                "title": {
                    "de": "Neues Dashboard",
                    "en": "New Dashboard"
                },
                "description": {
                    "de": "Hinzugefügt: Anpassbares Dashboard. Gehe zur Einstellungsseite, um es anzupassen.",
                    "en": "Added a customizable dashboard. Go to the settings page to customize it."
                },
                "icon": "grid-outline"
            },
            {
                "title": {
                    "de": "Akzentfarben",
                    "en": "Accent Colors"
                },
                "description": {
                    "de": "Wähle aus 9 verschiedenen Akzentfarben, um deine Erfahrung zu personalisieren.",
                    "en": "Choose from 9 different accent colors to personalize your experience."
                },
                "icon": "color-palette-outline"
            },
            {
                "title": {
                    "de": "Onboarding & Changelog",
                    "en": "Onboarding & Changelog"
                },
                "description": {
                    "de": "Diese neue Übersicht zeigt die wichtigsten Änderungen nach einem Update. Neue Nutzern wird außerdem ein Onboarding angezeigt.",
                    "en": "This new overview shows the most important changes after an update. New users also see an onboarding."
                },
                "icon": "newspaper-outline"
            }
        ],
        "0.3": [
            {
                "title": {
                    "de": "Lokalisierung (DE / EN)",
                    "en": "Localization (DE / EN)"
                },
                "description": {
                    "de": "Die App ist nun in zwei Sprachen verfügbar. Die Sprache kann in den Einstellungen geändert werden.",
                    "en": "The app is now available in two languages. The language can be changed in the settings."
                },
                "icon": "language-outline"
            },
            {
                "title": {
                    "de": "Studenplan",
                    "en": "Timetable"
                },
                "description": {
                    "de": "Dein Stundenplan ist nun für angemeldete Nutzer verfügbar. Er zeigt zudem wichtige Kalendar Termine und Fristen an.",
                    "en": "Your timetable is now available for logged in users. It also shows important calendar dates and deadlines."
                },
                "icon": "calendar-outline"
            },
            {
                "title": {
                    "de": "Essens Variationen",
                    "en": "Food Variations"
                },
                "description": {
                    "de": "Verfügbare Variationen werden nun in den Detaisl angezeigt. Außerdem kann nach dauerhaft verfügbaren Gerichten gefiltert werden.",
                    "en": "Available variations are now displayed in the details. In addition, you can filter by permanently available dishes."
                },
                "icon": "fast-food-outline"
            }
        ]
    }
}
